documents/CompositeBPartnerTest_Request.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<SOAP-ENV:Body>
		<compositeOperation xmlns="http://idempiere.org/ADInterface/1_0">
			<CompositeRequest>
				<serviceType>CompositeBPartnerTest</serviceType>
				<operations>
					<operation preCommit="false" postCommit="false">
						<TargetPort>createData</TargetPort>
						<ModelCRUD>
							<serviceType>CreateImageTest</serviceType>
							<TableName/>
							<RecordID>0</RecordID>
							<Action>Create</Action>
							<DataRow>
								<field column="Name">
									<val>Test Composite BP_Logo</val>
								</field>
								<field column="Description">
									<val>5294419_Desc</val>
								</field>
								<field column="BinaryData">
									<val>/9j/4AAQSkZJRgABAQEAYABgAAD/4QBmRXhpZgAATU0AKgAAAAgABAEaAAUAAAABAAAAPgEbAAUA
AAABAAAARgEoAAMAAAABAAIAAAExAAIAAAAQAAAATgAAAAAAAABgAAAAAQAAAGAAAAABcGFpbnQu
bmV0IDQuMS42AP/bAEMAAgEBAgEBAgICAgICAgIDBQMDAwMDBgQEAwUHBgcHBwYHBwgJCwkICAoI
BwcKDQoKCwwMDAwHCQ4PDQwOCwwMDP/bAEMBAgICAwMDBgMDBgwIBwgMDAwMDAwMDAwMDAwMDAwM
DAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDAwMDP/AABEIAIwAjAMBIgACEQEDEQH/xAAf
AAABBQEBAQEBAQAAAAAAAAAAAQIDBAUGBwgJCgv/xAC1EAACAQMDAgQDBQUEBAAAAX0BAgMABBEF
EiExQQYTUWEHInEUMoGRoQgjQrHBFVLR8CQzYnKCCQoWFxgZGiUmJygpKjQ1Njc4OTpDREVGR0hJ
SlNUVVZXWFlaY2RlZmdoaWpzdHV2d3h5eoOEhYaHiImKkpOUlZaXmJmaoqOkpaanqKmqsrO0tba3
uLm6wsPExcbHyMnK0tPU1dbX2Nna4eLj5OXm5+jp6vHy8/T19vf4+fr/xAAfAQADAQEBAQEBAQEB
AAAAAAAAAQIDBAUGBwgJCgv/xAC1EQACAQIEBAMEBwUEBAABAncAAQIDEQQFITEGEkFRB2FxEyIy
gQgUQpGhscEJIzNS8BVictEKFiQ04SXxFxgZGiYnKCkqNTY3ODk6Q0RFRkdISUpTVFVWV1hZWmNk
ZWZnaGlqc3R1dnd4eXqCg4SFhoeIiYqSk5SVlpeYmZqio6Slpqeoqaqys7S1tre4ubrCw8TFxsfI
ycrS09TV1tfY2dri4+Tl5ufo6ery8/T19vf4+fr/2gAMAwEAAhEDEQA/APvCiiigAooooAKKKKAC
iiigAooooAKKKKACiiigAooooAKKKKACiiigAooooAKKKVVLsFUFmY4AHegBKK9y+EX7HF54hgh1
DxLNJp1rIA62cY/0hx23k8J9OT9DXj/7Un/Bbj9i3/gnBf3+k6j4x0jXPFulsYptF8K2p1vUkkH3
onmB8mJweCksyEHtQBWt9GvLyIyQ2tzLGoyWSJmA/HFQOjROVZWVh1BGCK+Z/EH/AAe1fAe21RV0
v4S/Fy8st2Glu/7PtpQvqEW4kBPTjcPrXpvwQ/4O1P2Of2kNTTRvGEPjT4e+dhBN4r0CO4sXY9AJ
LSS4Kj/akRAM9QOaAPSaK+gtL+D3w0/aj+HVp4w+FHinQ9U0jUVL2t/pF+moabdHuNyM21h0IB+U
8Fc14r448B6p8Otek03VrVre4TlT1SVezK3cH/6xweKAMeiiigAooooAKKKKACiiigAooooAK+gf
gb8N9D+DXw8vviV46vLDSdN0uyk1Nri/cR2+l2saF3uZGbhcKC2T90c9Tx5h8A/h+nxK+KGn6fOp
azjJuboDvGnOD7Mdq/8AAq/OP/g8o/4KYXWi2/hn9l/wnfzWsd5DF4k8aNbuUEsWSLKwbHVcq1w6
kY+W2I7igD5O/wCC33/By/4+/b48Uap4B+EOpa18P/gzayyW7S2k72uqeLl5UyXLqQ0duwzttgcE
NmTccKn5VUUUAFFFFAHun7Bn/BR/4vf8E3Pi3a+LfhX4rvdIYSq+oaRLI8uk63GOsV1bbgsikZAb
h0zlGU4Nf1Xf8E0f+Cknw1/4Lkfslza1ptsnh/xloJW21/QpZVmuvD92y5SWNsAyW0u0lHwNwV1I
DIQP43a+lv8Agkn/AMFD9c/4Jjftx+D/AInadLeSaHDONP8AE+nQOQNW0qUhbiIrnDMoxLHngSxR
noDQB/Td408H33gLxPd6TqEfl3Vm+1sfdcdQwPoQQR9ay6+hv2rtF0v4i/DbQfH+hzxX1ndwQyR3
UPMd3aTrvhlB9PmGPaSvnmgAooooAKKKKACiiigAooooA+gf2EtIR73xHfso8yNILdG9AxdmH/jq
flX8lX/BZ7456h+0V/wVY+PvibULg3X/ABWmo6VZv6WdjM1laj8ILeLp3zX9cX7CN6H0zxJb8bo5
beT3O4SD/wBlr+OP/gof4Pm+H37f3xx0GfzPN0fx/rtkxcks3l6jOucnrnGc985oA8dooooAKKKK
ACiiigD+vL/ghF8WLz9pb/ggJ8NbrWJfteoaL4fv9AYtzhdNuri3tB9RBBb/AIim1yv/AAbG+HJP
A3/BAjwrqU24LrD+ItTRXOcKt9dQjAPQHyM475z3rqqACiiigAooooAKKKKACiiigD1j9jnxkPDn
xV+wyPtg1qBoOTgeYvzp/JlHu1fgb/wdy/sNX37N/wDwUnm+JllYNH4R+NFlHqcU8a/uo9Tt40gv
IT6MwEM5z1Nw2OhA/Z+xvZtNvYbi3kaGe3cSRupwyMDkEfQ16L+3f+xX4H/4LW/sI6l4A8QzLpev
W7Le6XqaR75fD+rRoyxzhf4oXDOrJkbo3YAqwDKAfxi0V6h+2F+xx8Q/2EPjxrHw5+Jnh+68P+I9
HkOA6lrfUIckJc28mMSwvglXX3BwwZR5fQAUUUUAFdB8J/hbr3xx+J/h7wb4X06bVvEnirUYNK0y
yhHz3NxNII40HplmHJ4A5PFYCqXYKoJYnAA71/Rr/wAGvn/BBnUP2bFtv2l/jdpE2j+LZLWQ+DtA
1CPypdCtpIysmoXKtyk8kbMqRtgxozMw3OojAP0q0b4Qaf8AsK/8E7fAXwl0qSE/8I7oVj4cEsfH
2p44l+0z4wP9Y6yMTgcy9s14fXfftE/Fr/hbHjxprdn/ALKsAYLMHjcP4pMerH9AtcDQAUUUUAFF
FFABRRRQAUUUUAFdB8OPiTqnwt8RpqWlyhXxslicZjnTurD+vUVz9FAHrX7Un7J37P8A/wAFh/hH
beE/il4dt73UbIPJYTJN9l1jRZWGGe0uF5KnAJQho22rvjOAB+K/7Z3/AAZg/GP4c6pqGofBPxp4
b+JGhKzPa6XrEv8AZGtBeqx7mBtZGHQuZIQeDtHQfqhFK0EiujMjqdyspwVPqDXoHhH9qHxl4RVY
11T+0YVHEd8vnf8Aj3D/APj1AH81HiD/AINxv22PDWqLZ3HwD8SSTO2wNaalp13Fn3kiuGQDjqTi
vWP2ef8Ag0r/AGxPjNrscXiPwv4Y+F+lsQz33iHX7aclc87IbJriTcOwcID6jrX9Fdv+3L4gWI+d
o+jvJjgp5igfgWP86y9d/bN8YatbtHbjS9N3dHt7cs4/77Zh+lAHzb/wTP8A+Daf4A/8EwZdL+IP
xB1KP4nfEjSXW4t9W1eEQaXpM45VrOyy26RT92SVpHBUMgjPFfSnx/8A2nbj4kLNpOj+ZaaHnEjk
YlvMev8AdX/Z6nv6DzTxJ4t1Txhe/aNU1C71CYcBp5C+0egzwB7Dis6gAooooAKKKKACiiigAooo
oAKKKm03TrjWNQhtbWGSe4uHEcUaDLOxOABQBCBuOBXqnw5/ZJ8S+N4orm9Eeh2MgDB7gFpmX1EY
5/76K16p8KfgZoHwF8JXXijxddaXb3Gm273t3fXsyR2ejwopZ3LuQqhVBLSMQAAcEDJP4w/8Fbv+
DwK7t9X1TwL+yrbwxx2sjW9x4/1S0WbziDgnT7WQFdvHE06nIJxEOHIB+x2ufA/4Ufs/+GX1zx14
g03TdNtxmW/8QatFp9nERySWZkUD2ZjXzp8R/wDgvt+wP+z5eTQt8VPBd/fWpKhfDuh3Wr+aR/dn
toHiP1MmPev5Ovj/APtL/EL9qrx7N4o+JHjTxJ4316bI+2axfyXUkak52R7iRGg7IgCjsBXD0Af1
ZXv/AAd6/sa6dLshuviJdLj78Phfav8A49Ip/StLw5/wdh/sR+MHRdS8TeKNGVzhjqXhG6lVPr5C
yn8s9K/k7ooA/s0+Ef8AwUo/Yl/a2urez8M/Fb4S3eoX7AQWk98uh31wx/hWKfyZWb2AJr1jxZ+x
NoesxG40HVLrT2kG9ElxcQkHpg8MB7ktX8OdfSH7E3/BXD9ob/gnxrNtN8M/iZ4g03SYCN+gX0xv
9FnXPKm0m3RrnpvjCuB0YUAf1HfEf4H+I/hdKzalYs1nnC3cH7yBvx6r9GANcjXk/wDwR/8A+DpH
4a/t/wB5pvw5+MVjpXwy+KGqMtnasXJ8PeJJH4EcLyEtbysTgQzMQxwFkdmCD7T/AGiP2WI9DtJ9
d8Mwv9mjy91YD5vKHd4++0dSvbtxwADwSiiigAooooAKKKKACvpL9jn4Ox2Omf8ACV6hDm5ucpYK
w/1cfRpPq3IHsD/erwj4ceDJviF4403R4cqb6YK7D+BB8zt+Cgn8K4D/AIOa/wDgpmv/AATk/wCC
fv8Awh3g6/OmfET4rRyeH9DNs+2bStPRFF5dqeqlY3SFGBBDzqw+4aAPyz/4Oev+C6d7+2H8WNT+
Avwv1ea3+E/gu+a31y+tJ8L4v1GJiGG5T81nC4IReVkdTIdwERX8f6KKACiiigAooooAKKKKAFVi
jBlJDA5BHav6Pf8Ag1x/4L2X37QsNn+zf8aNem1DxtYwN/whev30u6bXLaNMtYTueWuI0UsjtkyI
rKx3oDJ/ODWx8PvH+tfCnx3ovifw3qV1o/iDw7ew6lpt/bPtms7iFxJHKh7MrKCPpQB/Zx+1f8FB
4D8QDXNNhC6TqkhEiKPltpjkkY7K3JHocjjivH69Z/4JhftsaL/wV6/4JueHPHD/AGWHWtStTpPi
a0gHy6XrNuF84KvO1SxjnQEk+XNHk5zXmGuaPceHtZurC6Ty7mzmaCVfRlJB/lQBVooooAKKKKAP
fv2HfA/n3+reIpk+WBRY2xPTccNIfqBsGfRjX8vf/Bxl+3fJ+3f/AMFTPHl/Y3kd14R+H87eDfDv
kzrNBJBZyOs1wjqdrrNcmeVXHWNoxk7Qa/p8+N/j7Vf2cP8AglD8UPG3hG4XT/EnhX4d694k026e
FJhDfQWFxcRSFHBVwsiJ8rAghQCCK/iZLbjk8k9TQAUUUUAFFFFABRRRQAUUUUAFFFFAH7Bf8Gd/
7fL/AAE/bi1n4LaxeNH4b+MlmX09Xf8Ad2+sWaPJGRnhfNt/PQ45Z0gHOBX7qftpeBV0Hx9a6zCm
2HWov3mOnnR4B/NSn1INfxrfAT4q618C/jj4P8aeG7r7F4g8J61aavp0+MiOeCZJIyRxkblGR3GR
X9vP7X2mQ6p8EZLqVf31ncQTREdmY7D+GHP6UAfJNFFFAH//2Q==</val>
								</field>
							</DataRow>
						</ModelCRUD>
					</operation>
					<operation preCommit="false" postCommit="false">
						<TargetPort>createData</TargetPort>
						<ModelCRUD>
							<serviceType>CreateBPartnerTest</serviceType>
							<TableName/>
							<RecordID>0</RecordID>
							<Action>Create</Action>
							<DataRow>
								<field column="Name">
									<val>Test Composite BP</val>
								</field>
								<field column="Value">
									<val>5294419</val>
								</field>
								<field column="TaxID">
									<val>5294419</val>
								</field>
								<field column="Logo_ID">
									<val>@AD_Image.AD_Image_ID</val>
								</field>
							</DataRow>
						</ModelCRUD>
					</operation>
				</operations>
				<ADLoginRequest xsi:type="ADLoginRequest">
					<user>superuser @ brerp.com.br</user>
					<pass>cafe123</pass>
					<lang>pt_BR</lang>
					<ClientID>1000000</ClientID>
					<RoleID>1000000</RoleID>
					<OrgID>5000003</OrgID>
					<WarehouseID>5000007</WarehouseID>
					<stage>9</stage>
				</ADLoginRequest>
			</CompositeRequest>
		</compositeOperation>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
